pengshulin/mcush/MindMotion/mm32f0/HAL_lib/inc/HAL_tim.h
#undef GLOBAL
/// @}

////////////////////////////////////////////////////////////////////////////////
/// @defgroup TIM_Exported_Functions
/// @{

////////////////////////////////////////////////////////////////////////////////
//=================  TimeBase management  ======================================
void TIM_DeInit(TIM_TypeDef* TIMx);
void TIM_TimeBaseStructInit(TIM_TimeBaseInitTypeDef* pInitStruct);
void TIM_TimeBaseInit(TIM_TypeDef* TIMx, TIM_TimeBaseInitTypeDef* pInitStruct);
void TIM_PrescalerConfig(TIM_TypeDef* TIMx, u16 prescaler, TIMUG_Typedef reloadMode);
void TIM_CounterModeConfig(TIM_TypeDef* TIMx, TIMCOUNTMODE_Typedef counterMode);
void TIM_SetCounter(TIM_TypeDef* TIMx, u32 counter);
void TIM_SetAutoreload(TIM_TypeDef* TIMx, u32 autoReload);
void TIM_UpdateDisableConfig(TIM_TypeDef* TIMx, FunctionalState state);
void TIM_UpdateRequestConfig(TIM_TypeDef* TIMx, TIMURS_Typedef source);
void TIM_ARRPreloadConfig(TIM_TypeDef* TIMx, FunctionalState state);
void TIM_SelectOnePulseMode(TIM_TypeDef* TIMx, TIMOPMODE_Typedef mode);
void TIM_SetClockDivision(TIM_TypeDef* TIMx, TIMCKD_TypeDef clockDiv);
void TIM_Cmd(TIM_TypeDef* TIMx, FunctionalState state);

u32 TIM_GetCounter(TIM_TypeDef* TIMx);
u16 TIM_GetPrescaler(TIM_TypeDef* TIMx);

//=================  Advanced-control timers specific features  ================
void TIM_BDTRStructInit(TIM_BDTRInitTypeDef* pInitStruct);
void TIM_BDTRConfig(TIM_TypeDef* TIMx, TIM_BDTRInitTypeDef* pInitStruct);
void TIM_CtrlPWMOutputs(TIM_TypeDef* TIMx, FunctionalState state);

//=================  Output Compare management  ================================
void TIM_OCStructInit(TIM_OCInitTypeDef* pInitStruct);
void TIM_OC1Init(TIM_TypeDef* TIMx, TIM_OCInitTypeDef* pInitStruct);
void TIM_OC2Init(TIM_TypeDef* TIMx, TIM_OCInitTypeDef* pInitStruct);
void TIM_OC3Init(TIM_TypeDef* TIMx, TIM_OCInitTypeDef* pInitStruct);
void TIM_OC4Init(TIM_TypeDef* TIMx, TIM_OCInitTypeDef* pInitStruct);
void TIM_SelectOCxM(TIM_TypeDef* TIMx, TIMCHx_Typedef channel, TIMOCMODE_Typedef mode);
void TIM_SetCompare1(TIM_TypeDef* TIMx, u32 compare);
void TIM_SetCompare2(TIM_TypeDef* TIMx, u32 compare);
void TIM_SetCompare3(TIM_TypeDef* TIMx, u32 compare);
void TIM_SetCompare4(TIM_TypeDef* TIMx, u32 compare);
void TIM_ForcedOC1Config(TIM_TypeDef* TIMx, TIMOCMODE_Typedef forcedAction);
void TIM_ForcedOC2Config(TIM_TypeDef* TIMx, TIMOCMODE_Typedef forcedAction);
void TIM_ForcedOC3Config(TIM_TypeDef* TIMx, TIMOCMODE_Typedef forcedAction);
void TIM_ForcedOC4Config(TIM_TypeDef* TIMx, TIMOCMODE_Typedef forcedAction);
void TIM_CCPreloadControl(TIM_TypeDef* TIMx, FunctionalState state);
void TIM_OC1PreloadConfig(TIM_TypeDef* TIMx, TIMOCPE_Typedef preload);
void TIM_OC2PreloadConfig(TIM_TypeDef* TIMx, TIMOCPE_Typedef preload);
void TIM_OC3PreloadConfig(TIM_TypeDef* TIMx, TIMOCPE_Typedef preload);
void TIM_OC4PreloadConfig(TIM_TypeDef* TIMx, TIMOCPE_Typedef preload);
void TIM_OC1FastConfig(TIM_TypeDef* TIMx, TIMOCFE_Typedef fast);
void TIM_OC2FastConfig(TIM_TypeDef* TIMx, TIMOCFE_Typedef fast);
void TIM_OC3FastConfig(TIM_TypeDef* TIMx, TIMOCFE_Typedef fast);
void TIM_OC4FastConfig(TIM_TypeDef* TIMx, TIMOCFE_Typedef fast);
void TIM_ClearOC1Ref(TIM_TypeDef* TIMx, TIMOCCE_Typedef clear);
void TIM_ClearOC2Ref(TIM_TypeDef* TIMx, TIMOCCE_Typedef clear);
void TIM_ClearOC3Ref(TIM_TypeDef* TIMx, TIMOCCE_Typedef clear);
void TIM_ClearOC4Ref(TIM_TypeDef* TIMx, TIMOCCE_Typedef clear);
void TIM_OC1PolarityConfig(TIM_TypeDef* TIMx, TIMCCxP_Typedef polarity);
void TIM_OC1NPolarityConfig(TIM_TypeDef* TIMx, TIMCCxNP_Typedef polarity);
void TIM_OC2PolarityConfig(TIM_TypeDef* TIMx, TIMCCxP_Typedef polarity);
void TIM_OC2NPolarityConfig(TIM_TypeDef* TIMx, TIMCCxNP_Typedef polarity);
void TIM_OC3PolarityConfig(TIM_TypeDef* TIMx, TIMCCxP_Typedef polarity);
void TIM_OC3NPolarityConfig(TIM_TypeDef* TIMx, TIMCCxNP_Typedef polarity);
void TIM_OC4PolarityConfig(TIM_TypeDef* TIMx, TIMCCxP_Typedef polarity);
void TIM_CCxCmd(TIM_TypeDef* TIMx, TIMCHx_Typedef channel, TIMCCxE_Typedef ccxEn);
void TIM_CCxNCmd(TIM_TypeDef* TIMx, TIMCHx_Typedef channel, TIMCCxNE_Typedef ccxnEn);
void TIM_SelectCOM(TIM_TypeDef* TIMx, FunctionalState state);

//=================  Input Capture management  =================================
void TIM_ICStructInit(TIM_ICInitTypeDef* pInitStruct);
void TIM_ICInit(TIM_TypeDef* TIMx, TIM_ICInitTypeDef* pInitStruct);
void TIM_PWMIConfig(TIM_TypeDef* TIMx, TIM_ICInitTypeDef* pInitStruct);
void TIM_SetIC1Prescaler(TIM_TypeDef* TIMx, TIMICPSC_Typedef psc);
void TIM_SetIC2Prescaler(TIM_TypeDef* TIMx, TIMICPSC_Typedef psc);
void TIM_SetIC3Prescaler(TIM_TypeDef* TIMx, TIMICPSC_Typedef psc);
void TIM_SetIC4Prescaler(TIM_TypeDef* TIMx, TIMICPSC_Typedef psc);

u32 TIM_GetCapture1(TIM_TypeDef* TIMx);
u32 TIM_GetCapture2(TIM_TypeDef* TIMx);
u32 TIM_GetCapture3(TIM_TypeDef* TIMx);
u32 TIM_GetCapture4(TIM_TypeDef* TIMx);

//=================  Interrupts, DMA and flags management  =====================
void TIM_ITConfig(TIM_TypeDef* TIMx, TIMIT_TypeDef it, FunctionalState state);
void TIM_GenerateEvent(TIM_TypeDef* TIMx, TIMEGR_Typedef source);
void TIM_ClearFlag(TIM_TypeDef* TIMx, TIMFLAG_Typedef flag);
void TIM_ClearITPendingBit(TIM_TypeDef* TIMx, TIMIT_TypeDef it);
void TIM_DMAConfig(TIM_TypeDef* TIMx, TIMDMABASE_Typedef DMABase, TIMDMABURSTLENGTH_Typedef length);
void TIM_DMACmd(TIM_TypeDef* TIMx, TIMDMASRC_Typedef source, FunctionalState state);
void TIM_SelectCCDMA(TIM_TypeDef* TIMx, FunctionalState state);

FlagStatus TIM_GetFlagStatus(TIM_TypeDef* TIMx, TIMFLAG_Typedef flag);
ITStatus   TIM_GetITStatus(TIM_TypeDef* TIMx, TIMIT_TypeDef it);

//=================  Clocks management  ========================================
void TIM_InternalClockConfig(TIM_TypeDef* TIMx);
void TIM_ITRxExternalClockConfig(TIM_TypeDef* TIMx, TIMTS_TypeDef source);
void TIM_TIxExternalClockConfig(TIM_TypeDef* TIMx, TIM_TIEXTCLKSRC_Typedef source, TIMICP_Typedef polarity, u16 filter);
void TIM_ETRClockMode1Config(TIM_TypeDef* TIMx, TIMEXTTRGPSC_Typedef psc, TIMETP_Typedef polarity, u16 filter);
void TIM_ETRClockMode2Config(TIM_TypeDef* TIMx, TIMEXTTRGPSC_Typedef psc, TIMETP_Typedef polarity, u16 filter);

//=================  Synchronization management  ===============================
void TIM_SelectInputTrigger(TIM_TypeDef* TIMx, TIMTS_TypeDef source);
void TIM_SelectOutputTrigger(TIM_TypeDef* TIMx, TIMMMS_Typedef source);
void TIM_SelectSlaveMode(TIM_TypeDef* TIMx, TIMSMSMODE_Typedef mode);
void TIM_SelectMasterSlaveMode(TIM_TypeDef* TIMx, TIMMSM_Typedef mode);
void TIM_ETRConfig(TIM_TypeDef* TIMx, TIMEXTTRGPSC_Typedef psc, TIMETP_Typedef polarity, u16 filter);

//=================  Specific interface management  ============================
void TIM_EncoderInterfaceConfig(TIM_TypeDef*          TIMx,
                                TIMSMSENCODER_Typedef encoderMode,
                                TIMICP_Typedef        IC1Polarity,
                                TIMICP_Typedef        IC2Polarity);
void TIM_SelectHallSensor(TIM_TypeDef* TIMx, FunctionalState state);

//=================  extend Channel IC management  ==============================
void exTIM_SetIC1Plority(TIM_TypeDef* TIMx, TIMICP_Typedef pol);
void exTIM_SetIC2Plority(TIM_TypeDef* TIMx, TIMICP_Typedef pol);
void exTIM_SetIC3Plority(TIM_TypeDef* TIMx, TIMICP_Typedef pol);
void exTIM_SetIC4Plority(TIM_TypeDef* TIMx, TIMICP_Typedef pol);

#if defined(__MM0P1) || defined(__MM0Q1)
//=================  extend Channel 5 management  ==============================
void exTIM_SetCompare5(TIM_TypeDef* TIMx, u32 compare);
void exTIM_OC5Init(TIM_TypeDef* TIMx, TIM_OCInitTypeDef* pInitStruct);
void exTIM_OC5PreloadConfig(TIM_TypeDef* TIMx, TIMOCPE_Typedef preload);
void exTIM_OC5PolarityConfig(TIM_TypeDef* TIMx, TIMCCxP_Typedef polarity);
void exTIM_OC5FastConfig(TIM_TypeDef* TIMx, TIMOCFE_Typedef fast);
void exTIM_ClearOC5Ref(TIM_TypeDef* TIMx, TIMOCCE_Typedef clear);

u32 exTIM_GetCapture5(TIM_TypeDef* TIMx);
#endif

#if defined(__MM3O1) || defined(__MM0P1) || defined(__MM0Q1)
//============= extend Advanced-control timers specific features  ==============
void exTIM_DirectOutput(TIM_TypeDef* TIMx, FunctionalState state);
#endif

/// @}

/// @}

/// @}

////////////////////////////////////////////////////////////////////////////////
#endif /* __HAL_TIM_H */
////////////////////////////////////////////////////////////////////////////////
